---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.GeometryInstance
source: html/56d06b4e-8695-9343-6b74-ae9ff9e27152.htm
---
# GeometryInstance Members

Causes the object to release immediately any resources it may be utilizing.